backend/app/controllers/user_medicines_controller.rb

SELECT "user_medicines".* FROM "user_medicines"
---
  def index
    render json: UserMedicine.all

INSERT INTO "user_medicines" ("name", "dose", "morning", "evening", "composite_id", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    medicine = UserMedicine.create(user_medicine_params)

SELECT  "user_medicines".* FROM "user_medicines" WHERE "user_medicines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "user_medicines" SET "morning" = $1, "evening" = $2, "updated_at" = $3 WHERE "user_medicines"."id" = $4  [["morning", false], ["evening", true], ["updated_at", "2019-08-21 09:35:08.056805"], ["id", 19]]
---
  def update
    medicine = UserMedicine.find_by(id: params[:id])
    medicine.update(user_medicine_params)

SELECT  "user_medicines".* FROM "user_medicines" WHERE "user_medicines"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "user_medicines" WHERE "user_medicines"."id" = $1  [["id", 8]]
---
  def destroy
    medicine = UserMedicine.find_by(id: params[:id])
    medicine.destroy